{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "retrieve_object",
    "1": "locate_object",
    "2": "scan_environment",
    "3": "navigate",
    "4": "multi_step_retrieve",
    "5": "multi_step_manipulation"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "locate_object": 1,
    "multi_step_manipulation": 5,
    "multi_step_retrieve": 4,
    "navigate": 3,
    "retrieve_object": 0,
    "scan_environment": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
